app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.article_id = 3)
---
  def show
    @article = Article.find(params[:id])
    @comments = @article.comments.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 7)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`created_at`, `title`, `updated_at`, `description`) VALUES('2011-08-26 20:19:45', 'desh', '2011-08-26 20:19:45', 'desh bangladesh')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 7)
DELETE FROM `articles` WHERE `id` = 7
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy