app/controllers/comments_controller.rb

INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `article_id`) VALUES(NULL, '2011-08-27 16:27:21', '2011-08-27 16:27:21', NULL)
SELECT * FROM `articles` WHERE (`articles`.`id` = 3)
---
  def create
    #@comment = Comment.new(params[:article_id])
    @comment = Article.find(params[:article_id]).comments.create(params[:comment])